{"class_name": "Sequential", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "Conv1D", "config": {"kernel_size": [3], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "dtype": "float32", "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "strides": [1], "batch_input_shape": [null, null, 32], "activity_regularizer": null, "filters": 32, "name": "conv1d_1", "activation": "tanh"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "scale": true, "name": "batch_normalization_1", "center": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"data_format": "channels_last", "trainable": true, "strides": [2], "pool_size": [2], "name": "max_pooling1d_1", "padding": "valid"}}, {"class_name": "GRU", "config": {"return_sequences": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "implementation": 1, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "go_backwards": false, "recurrent_constraint": null, "unroll": false, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "units": 32, "reset_after": false, "stateful": false, "recurrent_regularizer": null, "recurrent_dropout": 0.1, "dropout": 0.2, "name": "gru_1", "bias_regularizer": null, "use_bias": true, "activation": "tanh", "kernel_constraint": null, "return_state": false, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "dense_1", "bias_regularizer": null, "use_bias": true, "activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "units": 1, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null}}], "name": "sequential_1"}, "backend": "tensorflow"}