{"config": {"name": "sequential_1", "layers": [{"config": {"data_format": "channels_last", "name": "conv1d_1", "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "strides": [1], "filters": 32, "kernel_constraint": null, "use_bias": true, "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1], "kernel_size": [3], "bias_regularizer": null, "batch_input_shape": [null, null, 32], "activity_regularizer": null, "kernel_regularizer": null, "dtype": "float32", "bias_constraint": null}, "class_name": "Conv1D"}, {"config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_1", "trainable": true, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "gamma_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"data_format": "channels_last", "name": "max_pooling1d_1", "trainable": true, "strides": [2], "pool_size": [2], "padding": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"name": "gru_1", "go_backwards": false, "trainable": true, "dropout": 0.2, "stateful": false, "use_bias": true, "recurrent_activation": "hard_sigmoid", "units": 32, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "return_state": false, "return_sequences": false, "recurrent_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activation": "tanh", "unroll": false, "recurrent_dropout": 0.1, "reset_after": false, "implementation": 1, "kernel_regularizer": null, "bias_constraint": null}, "class_name": "GRU"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "sigmoid", "name": "dense_1", "use_bias": true, "units": 1, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4"}